Feature: Введення площі користувачем

  Scenario Outline: Користувач вводить площу та кількість квартир
    Given Користувач почав взаємодію з ботом
    When Користувач вводить площу "<area>"
    Then Площа повинна бути збережена в системі як "<area>"

    When Користувач вводить кількість квартир "<apartments>"
    Then Кількість квартир повинна бути збережена в системі як "<apartments>"

    Then Кількість контейнерів має бути "<calc_res>"

  Examples:
    | area   | apartments | calc_res |
    | 150000 | 5000       | 64       |
    | 200000 | 8000       | 76       |
    | 100000 | 3000       | 45       |