"""
Модуль конфігурації для Telegram-бота.

Цей модуль містить токен бота, ID адміністратора, стандартні повідомлення,
питання з відповідями, а також контактну інформацію.

Для роботи бота, цей файл треба перейменувати у config.py, вставити токен бота, та айді менеджера.
"""
# Токен бота

import telebot

TOKEN = 'Ваш токен бота'
bot = telebot.TeleBot(TOKEN)
# ID адміністратора
ADMIN_ID = "Айді менеджера"
#ADMIN_ID_SECOND = "айді менеджера 2"

# Повідомлення
START_MESSAGE = ('Привіт! 😊\n'
                 'Я ваш персональний помічник від компанії "ЕКО ЛОГІЧНІ СИСТЕМИ". Дякую, що обрали нас! 🌟\n\n'
                 '<strong>Зі мною ви зможете:</strong>\n'
                 '🛒<strong>Скористатися конфігуратором замовлень</strong>, щоб швидко та зручно створити своє замовлення відповідно до ваших потреб.\n\n'
                 '🌐<strong>Переглянути каталог</strong> для детальнішого ознайомлення з нашими продуктами.\n\n'
                 '⁉️<strong>Отримати відповіді на ваші питання</strong> та зворотній зв`язок.')

HELP_MESSAGE = ('Оберіть питання, яке Вас цікавить\n\n'
                'Не знайшли тут Вашого питання?\n'
                'Скористайтеся кнопкою "Зворотній зв`язок", та напишіть нам!')
CONFIG_MESSAGE = 'Оберіть, Ви забудовник, чи приватний покупець.'

CONFIG_CUSTOMER_MESSAGE = 'Конфігуратор замовлення для приватних клієнтів.\nОберіть бажаний вид контейнеру:'
CONFIG_RA_AREA_MESSAGE = 'Конфігуратор замовлення для забудовників.\n✍🏻 Введіть площу ЖК:'
CONFIG_RA_APARTMENTS_MESSAGE = '✍🏻 Введіть кількість квартир:'

VALUE_ERROR_MESSAGE = 'Будь ласка, введіть числове значення'

CONTACT_MESSAGE = 'Все ще потрібна допомога? Зв’яжіться з нами!'

# Питання
QUESTIONS = {
    'firstQuestion': ('Чи піддаються контейнери корозії?',
                      '<strong>Чи піддаються контейнери корозії? - ❌ Ні.</strong>\n'
                      'Усі залізні деталі  конструкції виготовленні за технологією гарячого цинкування, що вважається '
                      'одним з найнадійніших методів захисту  заліза і  сталі від корозії. За даними American '
                      'Galvanizer Association гаряче цинкування забезпечує захист від корозії до 85 років у міському '
                      'середовищі. Тому контейнери можна очищувати за допомогою води з використанням хімічних засобів.'),

    'secondQuestion': ('Як дізнатися чи заповнений контейнер?',
                       '<strong>Як дізнатися чи заповнений контейнер? - 📡</strong>\n'
                       'Контейнер оснащений лазерним датчиком заповнення сміттям та GPRS-модемом для диспетчеризації '
                       'логістики. Автоматизація процесів дозволяє вчасно реагувати на наповненість контейнерів та '
                       'оптимізувати логістику вивозу сміття.'),

    'thirdQuestion': ('Чи є в контейнерах захист від пожежі?',
                      '<strong>Чи є в контейнерах захист від пожежі? - ✅ Так, є</strong>\n'
                      'Контейнер обладнаний автономною системою пожежогасіння. Спрацьовує при підвищенні температури '
                      'повітря у контейнері вище 68°С. Об’єм захисту такої системи – 12 м³, у той час, '
                      'як максимальний об’єм контейнеру 5 м³. Це запобігає самозайманню і горінню сміття у місті. '),

    'fourthQuestion': ('Чи є контейнери для небезпечних відходів?',
                       '<strong>Чи є контейнери для небезпечних відходів? - ✅ Так, є</strong>\n'
                       'Контейнер для небезпечних відходів - металевий призначений для збору використаних ламп, '
                       'батарейок, акумуляторів та термометрів. У такому сміттєвому баку вони підлягають безпечному '
                       'зберіганню та транспортуванню, гарантовано не зможуть завдати шкоди природі і здоров`ю '
                       'людини. ')
}

# Контактна інформація
CONTACTS_MESSAGE = ('Ваша контактна інформація')
