# Токен бота
import telebot
from telebot import types

TOKEN = '7367025283:AAFahZ2L7v-YugDOLAedTkxOqQ02MbHW8jg'
bot = telebot.TeleBot(TOKEN)
# ID адміністратора
ADMIN_ID = 516166196

# Повідомлення
START_MESSAGE = 'Привіт! \n Я бот.....'
HELP_MESSAGE = 'Ось відповіді на часті запитання:'
CONFIG_MESSAGE = 'Оберіть, чи ви звичайний покупець, чи представник ЖК.'

CONFIG_CUSTOMER_MESSAGE = 'Конфігуратор контейнерів для звичайних покупців. Оберіть необхідний контейнер:'
CONTACT_MESSAGE = 'Все ще потрібна допомога? Зв’яжіться з нами!'

AR_CONFIG_SQUARE = 'Введіть площу'
AR_CONFIG_APARTMENTS = 'Введіть кількість квартир'

# Питання
QUESTIONS = {
    'firstQuestion': ('Чи піддаються контейнери корозії?',
                      '<strong>Чи піддаються контейнери корозії? - Ні.</strong>\n'
                      'Усі залізні деталі конструкції виготовленні за технологією гарячого цинкування...'),

    'secondQuestion': ('Як дізнатися чи заповнений контейнер?',
                       '<strong>Як дізнатися чи заповнений контейнер?</strong>\n'
                       'Контейнер оснащений лазерним датчиком заповнення сміттям та GPRS-модемом...'),

    'thirdQuestion': ('Чи є в контейнерах захист від пожежі?',
                      '<strong>Чи є в контейнерах захист від пожежі? - Так, є</strong>\n'
                      'Контейнер обладнаний автономною системою пожежогасіння...'),

    'fourthQuestion': ('Чи є контейнери для небезпечних відходів?',
                       '<strong>Чи є контейнери для небезпечних відходів? - Так, є</strong>\n'
                       'Контейнер для небезпечних відходів - металевий...')
}


# Контактна інформація
CONTACTS_MESSAGE = ('<strong>Адреса компанії:</strong>\n'
                    'м. Київ, вул. Бориспільська, 9 корпус, 94\n'
                    '<strong>Телефон:</strong>\n'
                    '+38 (068) 207-07-15\n'
                    '<strong>Графік роботи:</strong>\n'
                    'Пн.-Пт. 08:00-17:00\n'
                    '<strong>Пишіть, ми на зв`язку:</strong>\n'
                    'sf_els@ukr.net , elsinfo@ukr.net')

