from callbacks import setup_callbacks
from config import bot

if __name__ == '__main__':
    """
        Основна точка запуску для Telegram-бота. Ініціалізує та запускає бота.

        При запуску:
        - Виводиться повідомлення про запуск бота в консолі.
        - Налаштовуються зворотні виклики для обробки повідомлень та команд.
        - Запускається процес polling для бота, що дозволяє йому працювати без зупинок.

        Викликається функція `setup_callbacks` для налаштування обробників.
        Потім запускається метод `polling` для безперервної роботи бота.
    """
    print('Бота запущено!')
    setup_callbacks(bot)
    bot.polling(none_stop=True)
